floating/tools/moodyAPI-master/API/OpenFOAM/v1806/tutorials/mooredFloatingObject/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    stationaryWalls
    {
        type            fixedFluxPressure;
    }
    atmosphere
    {
        type            totalPressure;
        p0              uniform 0;
    }
    floatingObject
    {
        type            fixedFluxPressure;
    }
}

// ************************************************************************* //
